In [2]:
import pandas as pd
import numpy as np

obj = pd.Series([10,20,np.nan,30,40])
obj

0    10.0
1    20.0
2     NaN
3    30.0
4    40.0
dtype: float64

In [3]:
arr = np.arange(10,20)
obj = pd.Series(arr)
obj

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [4]:
obj.values

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19])

In [5]:
obj.index

RangeIndex(start=0, stop=10, step=1)

In [9]:
obj = pd.Series([10,20,30,40], index=['값','을','병','정'])
obj

값    10
을    20
병    30
정    40
dtype: int64

In [10]:
data = {'Seoul':350, 'Daegu':15, 'Busan':30}
data

{'Seoul': 350, 'Daegu': 15, 'Busan': 30}

In [11]:
country = pd.Series(data)
country

Seoul    350
Daegu     15
Busan     30
dtype: int64

In [13]:
country[2]

30

In [14]:
country[['Seoul','Daegu']]

Seoul    350
Daegu     15
dtype: int64

In [21]:
obj[1:3]

을    20
병    30
dtype: int64

In [22]:
data = {'Seoul':[51621, 307], 'Daegu':[10631, 6], 'Busan':[6360, 25]}
df = pd.DataFrame(data)
df

   Seoul  Daegu  Busan
0  51621  10631   6360
1    307      6     25

In [25]:
df1 = pd.DataFrame({
    'id' : [1,2,3],
    'customer_id' : [1,2,3],
    'customer_name' : ['Robert', 'Peter', 'Dave']
}, columns=['id', 'customer_id','customer_name'])
df1

   id  customer_id customer_name
0   1            1        Robert
1   2            2         Peter
2   3            3          Dave

In [27]:
df2 = pd.DataFrame({
    'id' : [1,2,4],
    'order_id' : [100,200,300],
    'order_date' : ['2021-01-21', '2021-02-03', '2020-10-01']
})
df2

   id  order_id  order_date
0   1       100  2021-01-21
1   2       200  2021-02-03
2   4       300  2020-10-01

In [29]:
pd.concat([df1, df2], axis=1)

   id  customer_id customer_name  id  order_id  order_date
0   1            1        Robert   1       100  2021-01-21
1   2            2         Peter   2       200  2021-02-03
2   3            3          Dave   4       300  2020-10-01

In [32]:
pd.merge(df1, df2)

   id  customer_id customer_name  order_id  order_date
0   1            1        Robert       100  2021-01-21
1   2            2         Peter       200  2021-02-03

In [33]:
pd.merge(df1, df2, how='outer')

   id  customer_id customer_name  order_id  order_date
0   1          1.0        Robert     100.0  2021-01-21
1   2          2.0         Peter     200.0  2021-02-03
2   3          3.0          Dave       NaN         NaN
3   4          NaN           NaN     300.0  2020-10-01

In [35]:
pd.merge(df1, df2, how='left')

   id  customer_id customer_name  order_id  order_date
0   1            1        Robert     100.0  2021-01-21
1   2            2         Peter     200.0  2021-02-03
2   3            3          Dave       NaN         NaN

In [36]:
pd.merge(df1, df2, how='right')

   id  customer_id customer_name  order_id  order_date
0   1          1.0        Robert       100  2021-01-21
1   2          2.0         Peter       200  2021-02-03
2   4          NaN           NaN       300  2020-10-01